** DONE get all the relevant info together
   CLOSED: [2017-02-20 Mon 20:55]
   CLOCK: [2017-02-20 Mon 20:37]--[2017-02-20 Mon 20:55] =>  0:18
   :END:
- Exercise slides, session sheet, correction sheet, etc
** DONE First lecture
   CLOSED: [2017-02-20 Mon 23:40]
   :LOGBOOK:
   CLOCK: [2017-02-20 Mon 20:55]--[2017-02-20 Mon 23:40] =>  2:45
   :END:

Sound EXCITED

- About the course

First two weeks are a little intro about automated mathematical reasoning.
Week three until seven are about Haskell.
After that, the functional programming part is done and you start with formal methods.
There will still be a little bit of Haskell, from time to time.

Sound EXCITED

- About language

I speak English, If you speak high german to me, I will understand you.
BUT please don't ask me to speak german.
In homeworks please use English.

Sound EXCITED

- About exercise sessions

We will have an exercise session once a week.
The exercise sessions are entirely optional, but I will try my best to make it worth your while.
I am tempted to say 'No extra material will be presented during the exercise session that you will need for your exam'.
It could be true that something is on the exam that I said but the professor hasn't, but then that's either background knowledge or Haskell.
In short: Know Haskell and basic math by the exam, then you don't need to come here.

We have one exercise sheet per week.
The sheet is due on at midnight at the end of the week via codeboard.
I will get you feedback by the next exercise session.

- Breaks:

We could either have a 2 hour session with a 15 min break or a 1h45min session without a break.
Which do you prefer?

Sound EXCITED

- About me

My name is Kerckhove.
I have four years of experience with this material.
I have worked with some of the top Haskell programmers in the world at Facebook, including some people who wrote the compiler.
This is the second year that I'm teaching this class.
I love this stuff, and I love talking about it.

If you have any questions.
Please let me know.
There's most likely someone else in the room with the exact same question.
and it might help me to realise I've explained something wrong or not enough.
I promise we will still finish on time.

Sound EXCITED

- Speed recap of lecture:

  - Declarative programming is cool
    The idea is to describe a result, as opposed to describing how to get there.
  - Haskell is weird:
    - Functional: side effects are controlled (at the type level)
    - Pure: immutable data, this allows for all kinds of optimisations
    - Lazy: allows us to work with infinite things and it automatically optimizes things.
    - Statically typed: Makes it MUCH easier to write programs that work.
    - Type inference: No need to annotate everything with types, the compiler will do that for you.
    - Concurrency: Because of all of the above, writing concurrent programs is easier than ever.

Please don't think about how slow this must be.
You are very smart people. Some people will cringe at these things and get an aversion to learning Haskell.
The Haskell compiler builders are also very smart, and have managed to make Haskell faster than Python, Java,
on par with C++ and only 3x slower than C, all while keeping in extremely elegant and safe.

If at any point I explain something about Haskell and you think 'this must be horrendously slow or expensive',
tell me, and I will explain to you the optimisations that are in place to make it so that you're wrong.

- Example of haskell usages.

People say Haskell is just for academics. WRONG

  - My compiler.
  - My website.
  - Pandoc
  - https://github.com/joeyh/git-annex
  - Facebook.com

- A tiny bit about types

A type is a set of values with a name. This is WRONG, but it's good enough for now.

So can you name some sets in increasing order of size?

0 elements: Void
1 element: Unit: ()
2 elements: Bool
3 elements: Ordering
4 elements: ...

Tuples are the product,
Or-types are the sum of two types
Then there are functions, which are the powers of types.

Types can have type parameters.
You can see it as a type function.
There is something to be said about kinds, but it's a bit too soon for that right now.
I just want to show you this concept once already.

Now you have an idea of what a type is, I can explain IO:

- Side effects in Haskell: The IO Data type

What I'm going to explain now is only half true, but for now this is the way you should think about it.
It's a bit like the public static void main (String[] args) in java. We'll explain the details later.

- In short:

IO in Haskell is an immutable value, just like any other value.
REPEAT.

It's type has a parameter. This parameter represents the value that it produces.
Give an example.

A value of type 'IO Int' is an IO action that results in an integer, when evaluated.
In general: a value of type 'IO A' is an IO action that results in value of type 'A', when evaluated.

A haskell program needs a 'main' function.
The main function is a value of type 'IO ()'
This means it's an IO action that produces a unit value. I.e. nothing.

The implementation of 'main' describes how this value of type 'IO ()' is built.
A value of type 'IO A' can be built from smaller pieces.
Here are the basics:


- A 'do' block allows you to make an IO value by putting IO values below each other.
  For example:
 
main :: IO ()
main = do
   launchMissiles
   launchMissiles

- When you have a value of type 'IO A', you can make an IO value with it, that uses the 'A' that is computed
  You do it like this:

myFunc :: IO Int
myOtherFunc :: Int -> IO ()

main :: IO
main = do
   i <- myFunc
   myOtherFunc i

- You can use any value of an arbitrary type 'A' to make a value of type IO that does nothing and produces that value.
  You do this with 'pure :: a -> IO a'

That is it
- Repeat this explanation once
any questions?

show examples.

- Conversion to and from String:

To make a string value from another value, use 'show'.
'show :: Show a => a -> String'.
I cannot explain type classes just yet.
For now just remember to read this type as
'If a can be shown, then the type is a -> String'.

Similarly
read :: Read a => String -> a
BUT READ IS UNSAFE
instead you should use Text.Read.readMaybe :: Read a => String -> Maybe a

Show examples.
Explain why type annotations might be necessary.


- Crypto messages.

Bring up slides for knowledge proofs.
** DONE prepare the second lecture
   CLOSED: [2017-02-28 Tue 12:27] DEADLINE: <2017-03-01 Wed>
   :LOGBOOK:
   CLOCK: [2017-02-28 Tue 11:06]--[2017-02-28 Tue 12:27] =>  1:21
   :END:

** DONE Grade the third assignments
   CLOSED: [2017-03-13 Mon 10:03] SCHEDULED: <2017-03-13 Mon>
   :LOGBOOK:
   CLOCK: [2017-03-13 Mon 07:58]--[2017-03-13 Mon 10:03] =>  2:05
   :END:
